This SPL query detects failed logon attempts on virtual machines DC and Client1.  
Windows uses EventCode **4625** for failed logons. My environment logs under main rather than directly under wineventlog.

index=main EventCode=4625

This helps identify repeated log on attempts, useful for recognizing potential brute force attacks early on.

Also ran:  index=main EventCode=4625 | stats count by Account_Name, Logon_Type
- Account_Name -> specified which account tried to login to each VM
- Logon_Type -> specified how it was attempted
  - 2 (Interactive) : password was physically typed 
  - 3 (Network) : machine is trying to authenticate over network 
  - 11 (CachedInteractive) : domain joined machine boots before domain controller is fully ready, so cached credentials get used but they don't work
- count -> specified how many times it was attempted

I also added Failure_Reason Status and was able to learn what some status codes meant.
- ...5E -> no logon server
- ...6A -> wrong password
- ...6D -> wrong username
- ...224 -> expired
- ...133 -> time difference between client and domain controller too great
